# Creation de Dataframe

* on va creer un data frame avec le module pandas
* j'espere que les etudiants vont comprendre

In [2]:
import pandas as pd
data = {'prenom': ['Alain', 'Abdel', 'Annie', 'Toto', 'Momo'],
        'nom': ['Flouflou', 'Clairclair', "?", 'Icano', 'Jolie'],
        'age': [42, 52, 36, 24, 73],
        'noteintra': [48, 84, 91, "?", "?"],
        'notefinal': ["92,50", "94,00", 77, 63, 75]}

In [3]:
# creation du DF
df = pd.DataFrame(data, columns=['prenom', 'nom', 'age', 'noteintra', 'notefinal'])

In [4]:
df

  prenom         nom  age noteintra notefinal
0  Alain    Flouflou   42        48     92,50
1  Abdel  Clairclair   52        84     94,00
2  Annie           ?   36        91        77
3   Toto       Icano   24         ?        63
4   Momo       Jolie   73         ?        75

In [5]:
df.to_csv('example.csv')

In [7]:
# charger de csv
df = pd.read_csv('example.csv', na_values=['?'])
df

   Unnamed: 0 prenom         nom  age  noteintra notefinal
0           0  Alain    Flouflou   42       48.0     92,50
1           1  Abdel  Clairclair   52       84.0     94,00
2           2  Annie         NaN   36       91.0        77
3           3   Toto       Icano   24        NaN        63
4           4   Momo       Jolie   73        NaN        75

In [8]:
df = pd.read_csv('example.csv', header=None)
df

     0       1           2    3          4          5
0  NaN  prenom         nom  age  noteintra  notefinal
1  0.0   Alain    Flouflou   42         48      92,50
2  1.0   Abdel  Clairclair   52         84      94,00
3  2.0   Annie           ?   36         91         77
4  3.0    Toto       Icano   24          ?         63
5  4.0    Momo       Jolie   73          ?         75

In [10]:
# Charger csv avec specification de noms de colonnes
df = pd.read_csv('example.csv', names=['UID', 'Prenom', 'Nom', 'Age', 'Note intra', 'Note final'])
df

   UID  Prenom         Nom  Age Note intra Note final
0  NaN  prenom         nom  age  noteintra  notefinal
1  0.0   Alain    Flouflou   42         48      92,50
2  1.0   Abdel  Clairclair   52         84      94,00
3  2.0   Annie           ?   36         91         77
4  3.0    Toto       Icano   24          ?         63
5  4.0    Momo       Jolie   73          ?         75

In [11]:
# Charger csv en specifiant "?" comme valeurs manquantes

df = pd.read_csv('example.csv', na_values=['?'])
pd.isnull(df)

  Unnamed: 0 prenom    nom    age noteintra notefinal
0      False  False  False  False     False     False
1      False  False  False  False     False     False
2      False  False   True  False     False     False
3      False  False  False  False      True     False
4      False  False  False  False      True     False